# IsParametric Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..IsParametric Property
Family Class See Also
---
Identifies whether the family contains parametric relations between some of its elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsParametric { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsParametric As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsParametric {
	bool get ();
}
```

# Remarks
A family is parametric if it contains parameter-driven relations between its elements, such as labeled dimensions or locked tangential joins.
Parametric families containing large sketches may cause performance problems. Caution is therefore advised before adding any constraints to a yet non-parametric family that already contains large sketches. See [!:DoesContainLargeSketches()].
# See Also
Family Class
Autodesk.Revit.DB Namespace